## Plan Result (sbox-aks)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 14 to add, 3 to change, 14 to destroy.</code></pre>

* Update
  * azurerm_resource_group.disks_resource_group
  * azurerm_resource_group.kubernetes_resource_group[&#34;00&#34;]
  * azurerm_resource_group.kubernetes_resource_group[&#34;01&#34;]
* Replace
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;msnode&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.aks_auto_shutdown[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.update_checker[0]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;msnode&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.aks_auto_shutdown[0]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.update_checker[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.disks_resource_group will be updated in-place
  ~ resource "azurerm_resource_group" "disks_resource_group" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/disks-sbox-rg"
        name     = "disks-sbox-rg"
      ~ tags     = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_resource_group.kubernetes_resource_group["00"] will be updated in-place
  ~ resource "azurerm_resource_group" "kubernetes_resource_group" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-00-rg"
        name     = "ss-sbox-00-rg"
      ~ tags     = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_resource_group.kubernetes_resource_group["01"] will be updated in-place
  ~ resource "azurerm_resource_group" "kubernetes_resource_group" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg"
        name     = "ss-sbox-01-rg"
      ~ tags     = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes["00"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_key_vault.hmcts_access_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "hmcts_access_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "ca8140a9e09e2ee23f7abkv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "azure-control-sbox-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_key_vault_secret.aks_admin_group_id will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "aks_admin_group_id" {
      + content_type            = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_key_vault_secret.kubernetes_cluster_client_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "kubernetes_cluster_client_secret" {
      + content_type            = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_resource_group.disks_resource_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "disks-sbox-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_resource_group.genesis_rg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "genesis_rg" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "genesis-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_resource_group.managed-identity-operator will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "managed-identity-operator" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "managed-identities-sbox-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_role_definition.builtin_role_definition will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_role_definition" "builtin_role_definition" {
      + assignable_scopes  = (known after apply)
      + description        = (known after apply)
      + id                 = (known after apply)
      + name               = "Contributor"
      + permissions        = (known after apply)
      + role_definition_id = (known after apply)
      + scope              = (known after apply)
      + type               = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_subnet.aks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "aks" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = (known after apply)
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "aks-00"
      + network_security_group_id                      = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "ss-sbox-network-rg"
      + route_table_id                                 = (known after apply)
      + service_endpoints                              = (known after apply)
      + virtual_network_name                           = "ss-sbox-vnet"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_subscription.subscription will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "subscription" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_user_assigned_identity.aks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "aks" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "aks-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "genesis-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].data.azurerm_user_assigned_identity.kubelet_uami[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "kubelet_uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "aks-kubelet-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "genesis-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster must be replaced
-/+ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      - azure_policy_enabled                = false -> null
      - disk_encryption_set_id              = "" -> null
      - dns_prefix_private_cluster          = "" -> null
      - edge_zone                           = "" -> null
      - enable_pod_security_policy          = false -> null
      ~ fqdn                                = "k8s-ss-sbox-aks-62e2e03e.hcp.uksouth.azmk8s.io" -> (known after apply)
      - http_application_routing_enabled    = false -> null
      ~ http_application_routing_zone_name  = "" -> (known after apply)
      ~ id                                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-00-aks" -> (known after apply)
      ~ kube_admin_config                   = (sensitive value)
      ~ kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      - local_account_disabled              = false -> null
        name                                = "ss-sbox-00-aks"
      ~ oidc_issuer_url                     = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/8138e90d-8679-430e-b82d-e7bc9ce594b5/" -> (known after apply)
      - open_service_mesh_enabled           = false -> null
      ~ portal_fqdn                         = "k8s-ss-sbox-aks-62e2e03e.portal.hcp.uksouth.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      ~ private_fqdn                        = "" -> (known after apply)
      ~ tags                                = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ auto_scaler_profile {
          ~ balance_similar_node_groups      = false -> (known after apply)
          ~ empty_bulk_delete_max            = "10" -> (known after apply)
          ~ expander                         = "random" -> (known after apply)
          ~ max_graceful_termination_sec     = "600" -> (known after apply)
          ~ max_node_provisioning_time       = "15m" -> (known after apply)
          ~ max_unready_nodes                = 3 -> (known after apply)
          ~ max_unready_percentage           = 45 -> (known after apply)
          ~ new_pod_scale_up_delay           = "0s" -> (known after apply)
          ~ scale_down_delay_after_add       = "10m" -> (known after apply)
          ~ scale_down_delay_after_delete    = "10s" -> (known after apply)
          ~ scale_down_delay_after_failure   = "3m" -> (known after apply)
          ~ scale_down_unneeded              = "10m" -> (known after apply)
          ~ scale_down_unready               = "20m" -> (known after apply)
          ~ scale_down_utilization_threshold = "0.5" -> (known after apply)
          ~ scan_interval                    = "10s" -> (known after apply)
          ~ skip_nodes_with_local_storage    = false -> (known after apply)
          ~ skip_nodes_with_system_pods      = true -> (known after apply)
        }

      ~ azure_active_directory_role_based_access_control {
          ~ admin_group_object_ids = [
              - "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              - (sensitive value),
            ] -> (known after apply)
          - client_app_id          = "" -> null
          - server_app_id          = "" -> null
          - server_app_secret      = (sensitive value)
          ~ tenant_id              = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ default_node_pool {
          - custom_ca_trust_enabled      = false -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - fips_enabled                 = false -> null
          ~ kubelet_disk_type            = "OS" -> (known after apply)
            name                         = "system"
          ~ node_count                   = 2 -> (known after apply)
          ~ node_labels                  = {} -> (known after apply)
          - node_taints                  = [] -> null
          ~ os_sku                       = "Ubuntu" -> (known after apply)
          ~ tags                         = {
              - "application"  = "core"
              - "autoShutdown" = "true"
              - "builtFrom"    = "hmcts/aks-sds-deploy"
              - "businessArea" = "Cross-Cutting"
              - "criticality"  = "Low"
              - "environment"  = "sandbox"
            } -> (known after apply)
          ~ vnet_subnet_id               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-00" -> (known after apply) # forces replacement
          + workload_runtime             = (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi",
            ] -> (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ key_vault_secrets_provider {
          ~ secret_identity          = [
              - {
                  - client_id                 = "2a5a9b03-66d4-4d76-a522-6c2b45c04fcf"
                  - object_id                 = "e077c888-bf08-4a65-96f3-37d833ab0b32"
                  - user_assigned_identity_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourcegroups/ss-sbox-00-aks-node-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azurekeyvaultsecretsprovider-ss-sbox-00-aks"
                },
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ kubelet_identity {
          ~ client_id                 = "3fbb7e58-9568-44b9-a847-34df64335854" -> (known after apply) # forces replacement
          ~ object_id                 = "fd657beb-8e34-42f2-9cc7-f9016a065849" -> (known after apply) # forces replacement
          ~ user_assigned_identity_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-kubelet-sbox-mi" -> (known after apply) # forces replacement
        }

      ~ network_profile {
          ~ dns_service_ip     = "10.0.0.10" -> (known after apply)
          ~ docker_bridge_cidr = "172.17.0.1/16" -> (known after apply)
          ~ ip_versions        = [
              - "IPv4",
            ] -> (known after apply)
          + network_mode       = (known after apply)
          + network_policy     = (known after apply)
          + pod_cidr           = (known after apply)
          ~ pod_cidrs          = [] -> (known after apply)
          ~ service_cidr       = "10.0.0.0/16" -> (known after apply)
          ~ service_cidrs      = [
              - "10.0.0.0/16",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ load_balancer_profile {
              ~ effective_outbound_ips      = [
                  - "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-00-aks-node-rg/providers/Microsoft.Network/publicIPAddresses/7d81b105-18f5-4099-90c6-abbbaa353f4e",
                ] -> (known after apply)
              ~ idle_timeout_in_minutes     = 0 -> (known after apply)
              ~ managed_outbound_ip_count   = 1 -> (known after apply)
              ~ managed_outbound_ipv6_count = 0 -> (known after apply)
              ~ outbound_ip_address_ids     = [] -> (known after apply)
              ~ outbound_ip_prefix_ids      = [] -> (known after apply)
              ~ outbound_ports_allocated    = 0 -> (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      ~ windows_profile {
          + admin_password = (sensitive value)
          ~ admin_username = "azureuser" -> (known after apply)
          + license        = (known after apply)

          + gmsa {
              + dns_server  = (known after apply)
              + root_domain = (known after apply)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled = false -> null
      -

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

- edge_zone                           = "" -> null
      - enable_pod_security_policy          = false -> null
      ~ fqdn                                = "k8s-ss-sbox-aks-46938da2.hcp.uksouth.azmk8s.io" -> (known after apply)
      - http_application_routing_enabled    = false -> null
      ~ http_application_routing_zone_name  = "" -> (known after apply)
      ~ id                                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks" -> (known after apply)
      ~ kube_admin_config                   = (sensitive value)
      ~ kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      - local_account_disabled              = false -> null
        name                                = "ss-sbox-01-aks"
      ~ oidc_issuer_url                     = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/97f00e89-3ef8-4914-b1e5-25fae9b9b7d4/" -> (known after apply)
      - open_service_mesh_enabled           = false -> null
      ~ portal_fqdn                         = "k8s-ss-sbox-aks-46938da2.portal.hcp.uksouth.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      ~ private_fqdn                        = "" -> (known after apply)
      ~ tags                                = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ auto_scaler_profile {
          ~ balance_similar_node_groups      = false -> (known after apply)
          ~ empty_bulk_delete_max            = "10" -> (known after apply)
          ~ expander                         = "random" -> (known after apply)
          ~ max_graceful_termination_sec     = "600" -> (known after apply)
          ~ max_node_provisioning_time       = "15m" -> (known after apply)
          ~ max_unready_nodes                = 3 -> (known after apply)
          ~ max_unready_percentage           = 45 -> (known after apply)
          ~ new_pod_scale_up_delay           = "0s" -> (known after apply)
          ~ scale_down_delay_after_add       = "10m" -> (known after apply)
          ~ scale_down_delay_after_delete    = "10s" -> (known after apply)
          ~ scale_down_delay_after_failure   = "3m" -> (known after apply)
          ~ scale_down_unneeded              = "10m" -> (known after apply)
          ~ scale_down_unready               = "20m" -> (known after apply)
          ~ scale_down_utilization_threshold = "0.5" -> (known after apply)
          ~ scan_interval                    = "10s" -> (known after apply)
          ~ skip_nodes_with_local_storage    = false -> (known after apply)
          ~ skip_nodes_with_system_pods      = true -> (known after apply)
        }

      ~ azure_active_directory_role_based_access_control {
          ~ admin_group_object_ids = [
              - "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              - (sensitive value),
            ] -> (known after apply)
          - client_app_id          = "" -> null
          - server_app_id          = "" -> null
          - server_app_secret      = (sensitive value)
          ~ tenant_id              = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ default_node_pool {
          - custom_ca_trust_enabled      = false -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - fips_enabled                 = false -> null
          ~ kubelet_disk_type            = "OS" -> (known after apply)
            name                         = "system"
          ~ node_count                   = 2 -> (known after apply)
          ~ node_labels                  = {} -> (known after apply)
          - node_taints                  = [] -> null
          ~ os_sku                       = "Ubuntu" -> (known after apply)
          ~ tags                         = {
              - "application"  = "core"
              - "autoShutdown" = "true"
              - "builtFrom"    = "hmcts/aks-sds-deploy"
              - "businessArea" = "Cross-Cutting"
              - "criticality"  = "Low"
              - "environment"  = "sandbox"
            } -> (known after apply)
          ~ vnet_subnet_id               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-01" -> (known after apply) # forces replacement
          + workload_runtime             = (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi",
            ] -> (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ key_vault_secrets_provider {
          ~ secret_identity          = [
              - {
                  - client_id                 = "89719071-4a0e-42b7-bdaf-ad1663d3dc50"
                  - object_id                 = "602c5f46-d79c-41e1-a789-17bbd2dc7dc8"
                  - user_assigned_identity_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourcegroups/ss-sbox-01-aks-node-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azurekeyvaultsecretsprovider-ss-sbox-01-aks"
                },
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ kubelet_identity {
          ~ client_id                 = "3fbb7e58-9568-44b9-a847-34df64335854" -> (known after apply) # forces replacement
          ~ object_id                 = "fd657beb-8e34-42f2-9cc7-f9016a065849" -> (known after apply) # forces replacement
          ~ user_assigned_identity_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-kubelet-sbox-mi" -> (known after apply) # forces replacement
        }

      ~ network_profile {
          ~ dns_service_ip     = "10.0.0.10" -> (known after apply)
          ~ docker_bridge_cidr = "172.17.0.1/16" -> (known after apply)
          ~ ip_versions        = [
              - "IPv4",
            ] -> (known after apply)
          + network_mode       = (known after apply)
          + network_policy     = (known after apply)
          + pod_cidr           = (known after apply)
          ~ pod_cidrs          = [] -> (known after apply)
          ~ service_cidr       = "10.0.0.0/16" -> (known after apply)
          ~ service_cidrs      = [
              - "10.0.0.0/16",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ load_balancer_profile {
              ~ effective_outbound_ips      = [
                  - "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-aks-node-rg/providers/Microsoft.Network/publicIPAddresses/811643bc-e514-453a-a8c0-017096d20869",
                ] -> (known after apply)
              ~ idle_timeout_in_minutes     = 0 -> (known after apply)
              ~ managed_outbound_ip_count   = 1 -> (known after apply)
              ~ managed_outbound_ipv6_count = 0 -> (known after apply)
              ~ outbound_ip_address_ids     = [] -> (known after apply)
              ~ outbound_ip_prefix_ids      = [] -> (known after apply)
              ~ outbound_ports_allocated    = 0 -> (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      ~ windows_profile {
          + admin_password = (sensitive value)
          ~ admin_username = "azureuser" -> (known after apply)
          + license        = (known after apply)

          + gmsa {
              + dns_server  = (known after apply)
              + root_domain = (known after apply)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled = false -> null
      - enable_host_encryption  = false -> null
      - enable_node_public_ip   = false -> null
      - fips_enabled            = false -> null
      ~ id                      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks/agentPools/linux" -> (known after apply)
      ~ kubelet_disk_type       = "OS" -> (known after apply)
      ~ kubernetes_cluster_id   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks" -> (known after apply) # forces replacement
        name                    = "linux"
      ~ node_count              = 2 -> (known after apply)
      ~ node_labels             = {} -> (known after apply)
      ~ os_disk_size_gb         = 128 -> (known after apply)
      ~ os_sku                  = "Ubuntu" -> (known after apply)
      ~ tags                    = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> (known after apply)
      ~ vnet_subnet_id          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-01" -> (known after apply) # forces replacement
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["msnode"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled = false -> null
      - enable_host_encryption  = false -> null
      - enable_node_public_ip   = false -> null
      - fips_enabled            = false -> null
      ~ id                      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks/agentPools/msnode" -> (known after apply)
      ~ kubelet_disk_type       = "OS" -> (known after apply)
      ~ kubernetes_cluster_id   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks" -> (known after apply) # forces replacement
        name                    = "msnode"
      ~ node_count              = 2 -> (known after apply)
      ~ node_labels             = {} -> (known after apply)
      ~ os_disk_size_gb         = 128 -> (known after apply)
      ~ os_sku                  = "Windows2019" -> (known after apply)
      ~ tags                    = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> (known after apply)
      ~ vnet_subnet_id          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-01" -> (known after apply) # forces replacement
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["01"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
      ~ id                         = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks|DiagLogAnalytics" -> (known after apply)
        name                       = "DiagLogAnalytics"
      ~ target_resource_id         = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

      - log {
          - category = "cloud-controller-manager" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "cluster-autoscaler" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "cluster-autoscaler"
          + enabled  = true
        }
      - log {
          - category = "csi-azuredisk-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "csi-azurefile-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "csi-snapshot-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "guard" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "guard"
          + enabled  = true
        }
      - log {
          - category = "kube-apiserver" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "kube-apiserver"
          + enabled  = true
        }
      - log {
          - category = "kube-audit" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-audit-admin" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "kube-audit-admin"
          + enabled  = false
        }
      - log {
          - category = "kube-controller-manager" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "kube-controller-manager"
          + enabled  = true
        }
      - log {
          - category = "kube-scheduler" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "kube-scheduler"
          + enabled  = true
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["01"].azurerm_role_assignment.aks_auto_shutdown[0] must be replaced
-/+ resource "azurerm_role_assignment" "aks_auto_shutdown" {
      ~ id                               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks/providers/Microsoft.Authorization/roleAssignments/1c4e3da9-42e0-ee31-dad5-3983e72d93dc" -> (known after apply)
      ~ name                             = "1c4e3da9-42e0-ee31-dad5-3983e72d93dc" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      ~ scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.kubernetes["01"].azurerm_role_assignment.node_infrastructure_update_scale_set must be replaced
-/+ resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      ~ id                               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-aks-node-rg/providers/Microsoft.Authorization/roleAssignments/88f30ede-cb9e-4a3e-8b2f-478e2fb624eb" -> (known after apply)
      ~ name                             = "88f30ede-cb9e-4a3e-8b2f-478e2fb624eb" -> (known after apply)
      ~ principal_id                     = "fd657beb-8e34-42f2-9cc7-f9016a065849" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> (known after apply)
      ~ scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-aks-node-rg" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes["01"].azurerm_role_assignment.update_checker[0] must be replaced
-/+ resource "azurerm_role_assignment" "update_checker" {
      ~ id                               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks/providers/Microsoft.Authorization/roleAssignments/258e63a2-c8c1-c7a1-ccf6-0dff6bb6ff1e" -> (known after apply)
      ~ name                             = "258e63a2-c8c1-c7a1-ccf6-0dff6bb6ff1e" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      ~ scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 14 to add, 3 to change, 14 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":351,"Program":"tfcmt","SHA1":"","Target":"sbox-aks","Vars":{}} -->